Repository: miurahr/translate-django-ja
Catalog: tm/django.tmx
Source language: en_us
Languages: ja

source: The code is straightforward. Each model is represented by a class that subclasses :class:`django.db.models.Model`. Each model has a number of class variables, each of which represents a database field in the model.
ja: コードは単純明解ですね。各モデルは一つのクラスで表現され、いずれも :class:`django.db.models.Model` のサブクラスです。各モデルには複数のクラス変数があり、個々のクラス変数はモデルのデータベースフィールドを表現しています。

source: Each field is represented by an instance of a :class:`~django.db.models.Field` class -- e.g., :class:`~django.db.models.CharField` for character fields and :class:`~django.db.models.DateTimeField` for datetimes. This tells Django what type of data each field holds.
ja: 各フィールドは :class:`~django.db.models.Field` クラスのインスタンスとして表現されています。例えば、 :class:`~django.db.models.CharField` は文字のフィールドで、 :class:`~django.db.models.DateTimeField` は日時フィー ルドです。こうしたクラスは、各フィールドにどのようなデータ型を記憶させるか を Django に教えます。

source: Some :class:`~django.db.models.Field` classes have required arguments. :class:`~django.db.models.CharField`, for example, requires that you give it a :attr:`~django.db.models.CharField.max_length`. That's used not only in the database schema, but in validation, as we'll soon see.
ja: :class:`~django.db.models.Field` クラスの中には必須の引数を持つものがありま す。例えば `~django.db.models.CharField` には :attr:`~django.db.models.CharField.max_length` を指定する必要があります。この引数はデータベーススキーマで使われる他、後で述べるバリデーションでも使われま す。

source: A :class:`~django.db.models.Field` can also have various optional arguments; in this case, we've set the :attr:`~django.db.models.Field.default` value of ``votes`` to 0.
ja: :class:`~django.db.models.Field` はいつくかオプションの引数も取れます。今回の場合、 ```votes`` の :attr:`~django.db.models.Field.default` 値を 0 に設定しました。

source: Activating models
ja: モデルを有効にする

source: That small bit of model code gives Django a lot of information. With it, Django is able to:
ja: 前述のようなほんのわずかなコードをモデルに書くだけで、 Django はたくさんの情報を知れます。このコードを使って、 Django は:

source: Create a database schema (``CREATE TABLE`` statements) for this app.
ja: アプリケーションのデータベーススキーマを作成 (``CREATE TABLE`` 文を実行) できます。

source: But first we need to tell our project that the ``polls`` app is installed.
ja: でもその前に ``polls`` アプリケーションをインストールしたことをプロジェクトに教えてやる必要があります。

source: Django apps are "pluggable": You can use an app in multiple projects, and you can distribute apps, because they don't have to be tied to a given Django installation.
ja: Django アプリケーションは「プラガブル (pluggable)」です。アプリケーショ ンは特定の Django インストールに結び付いていないので、アプリケーションを複数のプロジェクトで使ったり、単体で配布したりできます。

source: Now Django knows to include the ``polls`` app. Let's run another command:
ja: これで Django は ``polls`` アプリケーションが含まれていると知りました。もうひとつコマンドを実行しましょう:

source: Note the following:
ja: 以下に注意してください:

source: Primary keys (IDs) are added automatically. (You can override this, too.)
ja: 主キー (primary key, ID) は自動的に追加されます (この挙動もオーバライド可能です)。

source: By convention, Django appends ``"_id"`` to the foreign key field name. (Yes, you can override this, as well.)
ja: 便宜上、 Django は外部キーのフィールド名に ``"_id"`` を追加します。もちろんこの挙動もオーバライド可能です。

source: Playing with the API
ja: API で遊んでみる

source: Now, let's hop into the interactive Python shell and play around with the free API Django gives you.
ja: さぁ、 Python 対話シェルを起動して、 Django が提供する API で遊んでみましょう。

source: To invoke the Python shell, use this command:
ja: Python シェルを起動するには、以下のコマンドを実行します:

source: We're using this instead of simply typing "python", because :file:`manage.py` sets the ``DJANGO_SETTINGS_MODULE`` environment variable, which gives Django the Python import path to your :file:`mysite/settings.py` file.
ja: 単に “python” を実行しないのは、 Django に :file:`mysite/settings.py` ファイルへの import パスを与える ``DJANGO_SETTINGS_MODULE`` の環境変数を :file:`manage.py` で設定しているからです。

source: Bypassing manage.py
ja: manage.py を使わずに済ませる方法

source: Once you're in the shell, explore the :doc:`database API </topics/db/queries>`::
ja: シェルに入ったら :doc:`データベース API </topics/db/queries>` の世界を探検してみましょう::

source: Note the addition of ``import datetime`` and ``from django.utils import timezone``, to reference Python's standard :mod:`datetime` module and Django's time-zone-related utilities in :mod:`django.utils.timezone`, respectively.
ja: ``import datetime`` と ``from django.utils import timezone`` で Python の 標準モジュール :mod:`datetime` と Django のタイムゾーン関連ユーティリティの :mod:`django.utils.timezone` を参照していることに注意してください。

source: If you aren't familiar with time zone handling in Python, you can learn more in the :doc:`time zone support docs </topics/i18n/timezones>`.
ja: Python でのタイムゾーンの取り扱いに不慣れな場合は、 `タイムゾーンサポートドキュメント </topics/i18n/timezones>` を参照してください。

source: Save these changes and start a new Python interactive shell by running ``python manage.py shell`` again::
ja: 変更を保存して、もう一度 ``python manage.py shell`` を実行して新しい Python 対話シェルを始めましょう::

source: For more information on model relations, see :doc:`Accessing related objects </ref/models/relations>`. For more on how to use double underscores to perform field lookups via the API, see :ref:`Field lookups <field-lookups-intro>`. For full details on the database API, see our :doc:`Database API reference </topics/db/queries>`.
ja: モデルのリレーションについては :doc:`リレーション先オブジェクトにアクセスする </ref/models/relations>` を参照してください。 API を通じた、フィールドルックアップのためのダブルアンダースコアの使い方は :ref:`フィールドルックアップ <field-lookups-intro>` を参照してください。データーベース API の詳細は :doc:`データベース API リファレンス </topics/db/queries>` を参照してください。

source: When you're comfortable with the API, read :doc:`part 2 of this tutorial </intro/tutorial02>` to get Django's automatic admin working.
ja: API を使いこなせるようになったら、 :doc:`チュートリアルその2 </intro/tutorial02>` に進んで、 Django が自動生成する管理インタフェースを動かしてみましょう。

source: Writing your first Django app, part 2
ja: はじめての Django アプリ作成、その2

source: This tutorial begins where :doc:`Tutorial 1 </intro/tutorial01>` left off. We're continuing the Web-poll application and will focus on Django's automatically-generated admin site.
ja: このチュートリアルは :doc:`チュートリアルその 1 </intro/tutorial01>` の続きです。ここでは、引続き Web 投票アプリケーションの開発を例にして、Django が 自動生成する admin サイトを中心に解説します。

source: Generating admin sites for your staff or clients to add, change and delete content is tedious work that doesn't require much creativity. For that reason, Django entirely automates creation of admin interfaces for models.
ja: コンテンツの追加や変更、削除を行うためのスタッフや顧客向けの管サイト 構築は、創造性の欠けた退屈なものです。そこで、 Django ではモデルを管 理するためのインタフェース生成を完全に自動化しています。

source: Django was written in a newsroom environment, with a very clear separation between "content publishers" and the "public" site. Site managers use the system to add news stories, events, sports scores, etc., and that content is displayed on the public site. Django solves the problem of creating a unified interface for site administrators to edit content.
ja: Django はニュースルーム環境で開発されました。ニュースルーム環境では、 「コンテンツの作成者 (content publisher)」と「公開 (public) 」サイトをきわめて明確に区別しています。サイト管理者は新たな話題やイベント、 スポーツのスコアなどの入力にシステムを使い、コンテンツは公開用サイト上で表示されます。 Django は、サイト管理者向けの一元化されたコンテンツ編集インタフェースを提供しています。

source: The admin isn't intended to be used by site visitors. It's for site managers.
ja: admin はサイトの訪問者でなく、サイト管理者に使われることを意図しています。

source: Start the development server
ja: 開発サーバーの起動

source: Recall from Tutorial 1 that you start the development server like so:
ja: チュートリアルその 1 で、開発サーバを以下のように起動したのを思い出してください:

source: Now, open a Web browser and go to "/admin/" on your local domain -- e.g., http://127.0.0.1:8000/admin/. You should see the admin's login screen:
ja: 次はブラウザを起動して、ローカルドメインの “/admin/” 、つまり http://127.0.0.1:8000/admin/ にアクセスします。以下のような admin のログイ ン画面が表示されるはずです:

source: Doesn't match what you see?
ja: 自分のレイアウトと違う場合

source: If at this point, instead of the above login page, you get an error page reporting something like::
ja: もしこの時点で、上のログイン画面の代わりに以下のようなエラーの画面が表示された場合は:

source: then you're probably using a version of Django that doesn't match this tutorial version. You'll want to either switch to the older tutorial or the newer Django version.
ja: おそらくこのチュートリアルのバージョンとは違う Django のバージョンを 使用していることでしょう。古いチュートリアルを参照するか、新しいバージョンの Django を入手してください。

source: Enter the admin site
ja: admin サイトに入る

source: Make the poll app modifiable in the admin
ja: Poll アプリを admin 上で編集できるようにする

source: But where's our poll app? It's not displayed on the admin index page.
ja: ところで、 polls アプリはどこにあるんでしょう？ admin のインデクスページを見ても表示されていませんね。

source: Explore the free admin functionality
ja: admin の機能を探究してみる

source: Things to note here:
ja: 以下の点に注意してください:

source: The different model field types (:class:`~django.db.models.DateTimeField`, :class:`~django.db.models.CharField`) correspond to the appropriate HTML input widget. Each type of field knows how to display itself in the Django admin.
ja: モデルのフィールドの型 (:class:`~django.db.models.DateTimeField` 、 :class:`~django.db.models.CharField` など) によって適切な HTML 入力ウィジェッ トが対応しています。各種のフィールドには Django 管理サイトでデー タを表示する方法が定義されています。

source: Each :class:`~django.db.models.DateTimeField` gets free JavaScript shortcuts.
ja: 各 :class:`~django.db.models.DateTimeField` は JavaScript ショートカットがついています。日付 (dates) のカラムには「今日 (today)」 へのショートカットとカレンダーポップアップボタンがあります。

source: Dates get a "Today" shortcut and calendar popup, and times get a "Now" shortcut and a convenient popup that lists commonly entered times.
ja: 時刻 (times) には「現在 (now)」へのショートカットと、よく入力される時刻のリストを表示するポップアップボタンがあります。

source: The bottom part of the page gives you a couple of options:
ja: ページの末尾の部分には操作ボタンがいくつか表示されています:

source: Save -- Saves changes and returns to the change-list page for this type of object.
ja: 保存 (Save) – 変更を保存して、このモデルのチェンジリストのページに戻ります。

source: Save and continue editing -- Saves changes and reloads the admin page for this object.
ja: 保存して編集を続ける (Save and continue editing) – 変更を保存して、このオブジェクトの編集ページをリロードします。

source: Save and add another -- Saves changes and loads a new, blank form for this type of object.
ja: 保存してもう一つ追加 (Save and add another) – 変更を保存して、このモデルのオブジェクトを新規追加するための空の編集ページをロードします。

source: Delete -- Displays a delete confirmation page.
ja: 削除 (Delete) – 削除確認ページを表示します。

source: Change the "Date published" by clicking the "Today" and "Now" shortcuts. Then click "Save and continue editing." Then click "History" in the upper right. You'll see a page listing all changes made to this object via the Django admin, with the timestamp and username of the person who made the change:
ja: 「今日」や「現在」ショートカットをクリックして、「Date published」を変更してみましょう。変更したら、「保存して編集を続ける」を押します。次に、右上に ある「履歴 (History)」をクリックしてみましょう。ユーザが管理サイト上でオブジェクトに対して行った変更履歴の全てを、変更時刻と変更を行ったユーザ名付きでリストにしたページが表示されます:

source: Customize the admin form
ja: admin フォームのカスタマイズ

source: You'll follow this pattern -- create a model admin object, then pass it as the second argument to ``admin.site.register()`` -- any time you need to change the admin options for an object.
ja: このように、 admin のオプションを変更したいときには、モデルごとに admin オブジェクトを生成して、 ``admin.site.register()`` の 2 番目の引数に渡すと いうパターンに従ってください。

source: This particular change above makes the "Publication date" come before the "Question" field:
ja: 上の例では、「Publication date」フィールドの表示位置を「Question」フィールドよりも前に変更しています:

source: This isn't impressive with only two fields, but for admin forms with dozens of fields, choosing an intuitive order is an important usability detail.
ja: 二つしかフィールドがないので、あまりぱっとした変化ではありませんね。しかし admin フォームで何ダースものフィールドを操作するような場合には、直感的なフィー ルドの並び順というものはユーザビリティ上重要な要素です。

source: Adding related objects
ja: リレーションを張ったオブジェクトの追加

source: Yet.
ja: 今はまだ。

source: Now "Choices" is an available option in the Django admin. The "Add choice" form looks like this:
ja: これで、 Django の管理サイト上で「Choice」 を選べます。「Choice の追加」フォーム は以下のようになります::

source: It works like this: There are three slots for related Choices -- as specified by ``extra`` -- and each time you come back to the "Change" page for an already-created object, you get another three extra slots.
ja: 変わった点をみてみましょう。リレーション相手である ``Choice`` を表示するために 3 つのスロットがあります (``extra`` に指定した数ですね)。また、作成済みのオブジェクトを「編集する」ページに行けば、いつでも 3 つ余分のスロットが表示されるはずです。

source: At the end of the three current slots you will find an "Add another Choice" link. If you click on it, a new slot will be added. If you want to remove the added slot, you can click on the X to the top right of the added slot. Note that you can't remove the original three slots. This image shows an added slot:
ja: 現状ある3つのスロットの末尾に、「他の Choice を追加する (Add another Choice)」リンクがあります。クリックすると、新しいプロットが追加されます。追加されたスロットを削除したい場合は、追加されたスロット右上の 'X' をクリックしてください。最初からある 3 つのスロットを削除できないことに注意してください。この画像は追加されたスロットのみで有効です。

source: With that ``TabularInline`` (instead of ``StackedInline``), the related objects are displayed in a more compact, table-based format:
ja: ``StackedInline`` に変わって ``TabularInline`` を使うと、 リレーション相手のオブジェクトはよりコンパクトなテーブル形式で表示されます:

source: Note that there is an extra "Delete?" column that allows removing rows added using the "Add Another Choice" button and rows that have already been saved.
ja: 追加の "Delete?" カラムがあることに注意してください。 "Added Another Choice" ボタンで追加された行とすでに保存された行を削除するためにあります。

source: Customize the admin change list
ja: 管理サイトのチェンジリストページをカスタマイズする

source: Here's what it looks like at this point:
ja: ここでは以下のようになります:

source: You can click on the column headers to sort by those values -- except in the case of the ``was_published_recently`` header, because sorting by the output of an arbitrary method is not supported.
ja: カラムのヘッダをクリックすると、カラムの値に応じてエントリを並べ換えできます。ただし ``was_published_recently`` ヘッダは例外で、これはメソッドの戻り値を 使った並べ換えをサポートしていないからです。

source: Also note that the column header for ``was_published_recently`` is, by default, the name of the method (with underscores replaced with spaces), and that each line contains the string representation of the output.
ja: ``was_published_recently`` のカラムヘッダのデフォルト値がメソッドの名前になっている (アンダースコアは空白に置き換わっている)こと、各行が戻り値の文字列となっていることにも注意して下さい。

source: That adds a "Filter" sidebar that lets people filter the change list by the ``pub_date`` field:
ja: これで、「フィルタ (Filter)」サイドバーができ、チェンジリストを ``pub_date`` フィールドの値に従ってフィルタできるようになります:

source: The type of filter displayed depends on the type of field you're filtering on.
ja: 表示されるフィルタのタイプは、フィルタに使うフィールドのタイプによって変わります。

source: Because ``pub_date`` is a :class:`~django.db.models.DateTimeField`, Django knows to give appropriate filter options: "Any date," "Today," "Past 7 days," "This month," "This year."
ja: ``pub_date`` は :class:`~django.db.models.DateTimeField` なので、 Django はデフォルトのフィルタのオプションとして 「すべての日 (Any date)」、「今日 (Today)」、「過去 7 日間 (Past 7 days)」、 「今月 (This month)」そして「今年 (This year)」を与えればよいと考えます。

source: This is shaping up well. Let's add some search capability::
ja: 細工は隆々ですね。今度は検索機能を追加してみましょう::

source: Customize the admin look and feel
ja: 管理サイトのルック & フィールをカスタマイズする

source: Clearly, having "Django administration" at the top of each admin page is ridiculous. It's just placeholder text.
ja: 管理サイトの上部には「Django 管理 (Django adminstration)」と表示されていますが、これはいささか滑稽ですね。これは単なるプレースホルダテキストにすぎません。

source: That's easy to change, though, using Django's template system.
ja: 変更するのは簡単で、 Django のテンプレートシステムを使います。

source: The Django admin is powered by Django itself, and its interfaces use Django's own template system.
ja: Django の管理サイトは、それ自身 Django で作られているので、インタフェースは Django のテンプレートシステムを使っています。

source: Customizing your *project's* templates
ja: *プロジェクト* テンプレートをカスタムする。

source: If you have difficulty finding where the Django source files are located on your system, run the following command:
ja: Django のソースファイルがシステム中のどこにあるのか分からない場合は、以下のコマンドを実行してください:

source: This template file contains lots of text like ``{% block branding %}`` and ``{{ title }}``. The ``{%`` and ``{{`` tags are part of Django's template language. When Django renders ``admin/base_site.html``, this template language will be evaluated to produce the final HTML page. Don't worry if you can't make any sense of the template right now -- we'll delve into Django's templating language in Tutorial 3.
ja: このテンプレートファイルは "{% block branding %}" や "{{ title }}" のようなテキストを多く含んでいます。 "{%" と "{{" タグは Django のテンプレート言語の一部です。Djangoが "admin/base_site.html" をレンダリングする場合このテンプレート言語が実行され、最終的なHTMLページが出力されます。今テンプレートについて何もわからなくても心配しないでください。チュートリアル3で Django のテンプレート言語について掘り下げていきます。

source: Note that any of Django's default admin templates can be overridden. To override a template, just do the same thing you did with ``base_site.html`` -- copy it from the default directory into your custom directory, and make changes.
ja: Django のデフォルトの admin 用テンプレートは上書き可能です。上書きするには、ただ ``base_site.html`` にしたことと同じことをしてください。デフォルトのディレクトリからカスタム用のディレクトリにコピーして、変更してください。

source: Customizing your *application's* templates
ja: *アプリケーション用の* テンプレートをカスタマイズする

source: Our poll application is not very complex and doesn't need custom admin templates. But if it grew more sophisticated and required modification of Django's standard admin templates for some of its functionality, it would be more sensible to modify the *application's* templates, rather than those in the *project*. That way, you could include the polls application in any new project and be assured that it would find the custom templates it needed.
ja: 投票アプリケーションはそれほど複雑ではないので、カスタムのアドミンテンプレートは必要ないでしょう。しかしより凝ったものに成長したり、機能のため標準の admin テンプレートの変更は必要となった場合、 *アプリケーションの* テンプレートを編集するのは、 *プロジェクト* のそれを編集するより賢い選択になるでしょう。それにより、投票アプリケーションを他のどの新しいプロジェクトに追加できます。そのアプリが必要としているカスタムテンプレートを見つけることも見つけることもできます。

source: Customize the admin index page
ja: admin index ページをカスタムする

source: On a similar note, you might want to customize the look and feel of the Django admin index page.
ja: 近い話題として、 Django の admin index ページのルックアンドフィールをカスタマイズもできます。

source: By default, it displays all the apps in :setting:`INSTALLED_APPS` that have been registered with the admin application, in alphabetical order. You may want to make significant changes to the layout. After all, the index is probably the most important page of the admin, and it should be easy to use.
ja: デフォルトでは、 :settings:`INSTALLED_APPS` の全てのアプリを表示します。つまり admin アプリケーションに登録されたアプリケーションを、アルファベット順に表示されるということです。レイアウトに何か重要な変更をしたいかも知れません。なんといっても index ページは admin のなかで最も重要なページで、使いやすくあるべきです。

source: The template to customize is ``admin/index.html``. (Do the same as with ``admin/base_site.html`` in the previous section -- copy it from the default directory to your custom template directory.) Edit the file, and you'll see it uses a template variable called ``app_list``. That variable contains every installed Django app. Instead of using that, you can hard-code links to object-specific admin pages in whatever way you think is best. Again, don't worry if you can't understand the template language -- we'll cover that in more detail in Tutorial 3.
ja: カスタマイズ対象のテンプレートは "admin/index.html" です。 (前セクションで "admin/base_site.html" にしたことと同じことをしてください。デフォルトのディレクトリからコピーして、カスタムテンプレートのディレクトリに配置してください)。編集してみると "app_list" というテンプレート変数が使われているのが見えるでしょう。この変数はインストールされた全 Django アプリを含んでいます。ベストだと思うなら、これを使う代わりに、オブジェクト固有の管理ページヘのリンクをハードコードをしてもよいです。しつこいようですが、テンプレート言語の理解できなくても心配しないでください。より詳細にはチュートリアル3でカバーされます。

source: When you're comfortable with the admin site, read :doc:`part 3 of this tutorial </intro/tutorial03>` to start working on public poll views.
ja: admin サイトが満足すれば、 :doc:`チュートリアルその3 </intro/tutorial03>` に進んで、公開用の投票ビューを作りましょう。

source: Writing your first Django app, part 3
ja: はじめての Django アプリ作成、その 3

source: This tutorial begins where :doc:`Tutorial 2 </intro/tutorial02>` left off. We're continuing the Web-poll application and will focus on creating the public interface -- "views."
ja: このチュートリアルは :doc:`チュートリアルその 2 </intro/tutorial02>` の続きです。ここでは、引続き Web 投票アプリケーションの開発を例にして、公開用のインタフェース、ビュー(view) の作成を焦点に解説します。

source: A view is a "type" of Web page in your Django application that generally serves a specific function and has a specific template. For example, in a blog application, you might have the following views:
ja: ビューとは、 Django のアプリケーションにおいて特定の機能を提供するウェブペー ジの「型 (type)」であり、各々のテンプレートを持っています。例えばブログアプリケーションなら、以下のようなビューがあるでしょう:

source: Blog homepage -- displays the latest few entries.
ja: Blog ホームページ - 最新エントリーをいくつか表示

source: Entry "detail" page -- permalink page for a single entry.
ja: エントリー詳細ページ - 1エントリーへのパーマリンク (permalink) ページ

source: Year-based archive page -- displays all months with entries in the given year.
ja: 年ごとのアーカイブページ - 指定された年のエントリーの月を全て表示

source: Month-based archive page -- displays all days with entries in the given month.
ja: 月ごとのアーカイブページ - 指定された月のエントリーの日をすべて表示

source: Day-based archive page -- displays all entries in the given day.
ja: 日ごとのアーカイブページ - 指定された日の全てのエントリーを表示

source: Comment action -- handles posting comments to a given entry.
ja: コメント投稿 - エントリーに対するコメントの投稿を受付

source: In our poll application, we'll have the following four views:
ja: 投票アプリケーションでは、以下4つのビューを作成します:

source: Question "index" page -- displays the latest few questions.
ja: 質問 "インデックス" ページ -- 最新の質問をいくつか表示

source: Question "detail" page -- displays a question text, with no results but with a form to vote.
ja: 質問 "詳細" ページ -- 結果を表示せず、質問テキストと投票フォームを表示

source: Question "results" page -- displays results for a particular question.
ja: 質問 "結果" ページ -- 特定の質問の結果を表示

source: Vote action -- handles voting for a particular choice in a particular question.
ja: 投票ページ -- 特定の質問の選択を投票として受付

source: In Django, web pages and other content are delivered by views. Each view is represented by a simple Python function (or method, in the case of class-based views). Django will choose a view by examining the URL that's requested (to be precise, the part of the URL after the domain name).
ja: Django へだ、各ページとコンテンツはビューによって提供されます。各ビューは単純に Python 関数 (クラスベースビューの場合はメソッド) として実装されています。 Django はビューを、リクエストされたURLから決定します (正確には、URLのドメイン移行の部分)

source: Now in your time on the web you may have come across such beauties as "ME2/Sites/dirmod.asp?sid=&type=gen&mod=Core+Pages&gid=A6CD4967199A42D9B65B1B".
ja: インターネットサーフィンをしてるときなどに、 "ME2/Sites/dirmod.asp?sid=&type=gen&mod=Core+Pages&gid=A6CD4967199A42D9B65B1B" のような美しいURLを見かけることがあるでしょう。

source: You will be pleased to know that Django allows us much more elegant *URL patterns* than that.
ja: Django はこんなものよりもっとエレガントな "URLパターン" を提供していると知っておいてください。

source: A URL pattern is simply the general form of a URL - for example: ``/newsarchive/<year>/<month>/``.
ja: URLパターンはURLをシンプルに一般化したものです。例えば "/newsarchive/<year>/<month>/" などです。

source: To get from a URL to a view, Django uses what are known as 'URLconfs'.
ja: URLからビューには、 Django は 'URLconfs' として知られているものを使います。

source: A URLconf maps URL patterns (described as regular expressions) to views.
ja: URLconf は (正規表現で表される) URLパターンとビューを対応付けます。

source: This tutorial provides basic instruction in the use of URLconfs, and you can refer to :mod:`django.core.urlresolvers` for more information.
ja: このチュートリアルでは基本的な URLconf の使い方を紹介します。詳細については :mod:`django.core.urlresolvers` を参照してください。

source: Write your first view
ja: はじめてのビュー作成

source: Let's write the first view.
ja: 最初のビューを書いてみましょう。

source: Open the file ``polls/views.py`` and put the following Python code in it:
ja: ``polls/views.py`` を開いて、以下の Python コードを書いてください:

source: This is the simplest view possible in Django.
ja: Django上で最も単純なビューです。ビューを呼ぶために、 URL を対応付けしてやる必要があります。

source: To call the view, we need to map it to a URL - and for this we need a URLconf.
ja: URLconf が必要ですね。

source: To create a URLconf in the polls directory, create a file called ``urls.py``. Your app directory should now look like::
ja: polls ディレクトリに URLconf を作るには ``urls.py`` というファイルを作ります。アプリのディレクトリはこのようになっているはずです::

source: In the ``polls/urls.py`` file include the following code:
ja: ``polls/urls.py`` ファイルには以下のコードを書いてください:

source: The next step is to point the root URLconf at the ``polls.urls`` module.
ja: 次のステップはルート URLconf に ``polls.urls`` モジュールを指定することです。

source: In ``mysite/urls.py`` insert an :func:`~django.conf.urls.include`, leaving you with:
ja: ``mysite/urls.py`` に :func:`~django.conf.urls.include` を以下のように追加してください:

source: The :func:`~django.conf.urls.url` function is passed four arguments, two required: ``regex`` and ``view``, and two optional: ``kwargs``, and ``name``.
ja: :func:`~django.conf.urls.url` 関数は4つの引数を受け取り、そのうち2つが必須です。
